<template>
    <NavbarItem></NavbarItem>
    <div class="page-container padding-top padding-top_big company">

        <section class="container container_main  page-block company__logo-container">
            <svg class="company__logo" width="500" height="134" viewBox="0 0 500 134" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M61.2745 101.514L0 35.6591H61.2745V101.514Z" fill="white"/>
                <path d="M0 0.198639L23.5671 25.5275H70.7014V76.1853L94.2685 101.514V0.198639H0Z" fill="white"/>
                <path d="M223.746 28.1617V73.2978L208.145 90.0655H141.073V11.3433H208.098L223.746 28.1617ZM201.546 38.2933L196.455 32.7716H163.32V68.6879H196.455L201.546 63.1662V38.2933Z" fill="white"/>
                <path d="M315.092 90.2174H290.394L269.89 44.4734L249.34 90.2174H224.642L259.992 11.4446H279.694L315.092 90.2174Z" fill="white"/>
                <path d="M350.49 32.8727L343.42 40.3194H404.082V70.3594L385.228 90.3186H320.183V68.8904H373.774L380.844 61.4437H320.183V31.4036L338.942 11.5458H404.082V32.8727H350.49Z" fill="white"/>
                <path d="M436.416 38.8504H414.216V11.4952H436.416V38.8504ZM500 11.4446V90.2174H477.8V62.7102H445.654L436.416 72.6898V90.2174H414.263V62.7102L436.416 38.8504L477.8 38.7998V11.4952H500V11.4446Z" fill="white"/>
                <path d="M371.108 125.288C369.452 125.288 367.856 125.096 366.32 124.712C364.808 124.304 363.608 123.8 362.72 123.2L364.592 119.168C365.48 119.72 366.524 120.176 367.724 120.536C368.948 120.872 370.148 121.04 371.324 121.04C372.62 121.04 373.532 120.884 374.06 120.572C374.612 120.26 374.888 119.828 374.888 119.276C374.888 118.82 374.672 118.484 374.24 118.268C373.832 118.028 373.28 117.848 372.584 117.728C371.888 117.608 371.12 117.488 370.28 117.368C369.464 117.248 368.636 117.092 367.796 116.9C366.956 116.684 366.188 116.372 365.492 115.964C364.796 115.556 364.232 115.004 363.8 114.308C363.392 113.612 363.188 112.712 363.188 111.608C363.188 110.384 363.536 109.304 364.232 108.368C364.952 107.432 365.984 106.7 367.328 106.172C368.672 105.62 370.28 105.344 372.152 105.344C373.472 105.344 374.816 105.488 376.184 105.776C377.552 106.064 378.692 106.484 379.604 107.036L377.732 111.032C376.796 110.48 375.848 110.108 374.888 109.916C373.952 109.7 373.04 109.592 372.152 109.592C370.904 109.592 369.992 109.76 369.416 110.096C368.84 110.432 368.552 110.864 368.552 111.392C368.552 111.872 368.756 112.232 369.164 112.472C369.596 112.712 370.16 112.904 370.856 113.048C371.552 113.192 372.308 113.324 373.124 113.444C373.964 113.54 374.804 113.696 375.644 113.912C376.484 114.128 377.24 114.44 377.912 114.848C378.608 115.232 379.172 115.772 379.604 116.468C380.036 117.14 380.252 118.028 380.252 119.132C380.252 120.332 379.892 121.4 379.172 122.336C378.452 123.248 377.408 123.968 376.04 124.496C374.696 125.024 373.052 125.288 371.108 125.288ZM391.637 125.288C389.357 125.288 387.581 124.712 386.309 123.56C385.037 122.384 384.401 120.644 384.401 118.34V101.348H390.017V118.268C390.017 119.084 390.233 119.72 390.665 120.176C391.097 120.608 391.685 120.824 392.429 120.824C393.317 120.824 394.073 120.584 394.697 120.104L396.209 124.064C395.633 124.472 394.937 124.784 394.121 125C393.329 125.192 392.501 125.288 391.637 125.288ZM381.413 110.384V106.064H394.841V110.384H381.413ZM407.534 125.288C405.926 125.288 404.486 124.976 403.214 124.352C401.966 123.728 400.994 122.78 400.298 121.508C399.602 120.212 399.254 118.568 399.254 116.576V105.632H404.87V115.748C404.87 117.356 405.206 118.544 405.878 119.312C406.574 120.056 407.546 120.428 408.794 120.428C409.658 120.428 410.426 120.248 411.098 119.888C411.77 119.504 412.298 118.928 412.682 118.16C413.066 117.368 413.258 116.384 413.258 115.208V105.632H418.874V125H413.546V119.672L414.518 121.22C413.87 122.564 412.91 123.584 411.638 124.28C410.39 124.952 409.022 125.288 407.534 125.288ZM432.392 125.288C430.568 125.288 428.924 124.88 427.46 124.064C425.996 123.224 424.832 122.06 423.968 120.572C423.128 119.084 422.708 117.332 422.708 115.316C422.708 113.276 423.128 111.512 423.968 110.024C424.832 108.536 425.996 107.384 427.46 106.568C428.924 105.752 430.568 105.344 432.392 105.344C434.024 105.344 435.452 105.704 436.676 106.424C437.9 107.144 438.848 108.236 439.52 109.7C440.192 111.164 440.528 113.036 440.528 115.316C440.528 117.572 440.204 119.444 439.556 120.932C438.908 122.396 437.972 123.488 436.748 124.208C435.548 124.928 434.096 125.288 432.392 125.288ZM433.364 120.68C434.276 120.68 435.104 120.464 435.848 120.032C436.592 119.6 437.18 118.988 437.612 118.196C438.068 117.38 438.296 116.42 438.296 115.316C438.296 114.188 438.068 113.228 437.612 112.436C437.18 111.644 436.592 111.032 435.848 110.6C435.104 110.168 434.276 109.952 433.364 109.952C432.428 109.952 431.588 110.168 430.844 110.6C430.1 111.032 429.5 111.644 429.044 112.436C428.612 113.228 428.396 114.188 428.396 115.316C428.396 116.42 428.612 117.38 429.044 118.196C429.5 118.988 430.1 119.6 430.844 120.032C431.588 120.464 432.428 120.68 433.364 120.68ZM438.44 125V121.04L438.548 115.28L438.188 109.556V98.288H443.804V125H438.44ZM449.002 125V105.632H454.618V125H449.002ZM451.81 102.932C450.778 102.932 449.938 102.632 449.29 102.032C448.642 101.432 448.318 100.688 448.318 99.8C448.318 98.912 448.642 98.168 449.29 97.568C449.938 96.968 450.778 96.668 451.81 96.668C452.842 96.668 453.682 96.956 454.33 97.532C454.978 98.084 455.302 98.804 455.302 99.692C455.302 100.628 454.978 101.408 454.33 102.032C453.706 102.632 452.866 102.932 451.81 102.932ZM469.046 125.288C466.982 125.288 465.146 124.856 463.538 123.992C461.954 123.128 460.694 121.952 459.758 120.464C458.846 118.952 458.39 117.236 458.39 115.316C458.39 113.372 458.846 111.656 459.758 110.168C460.694 108.656 461.954 107.48 463.538 106.64C465.146 105.776 466.982 105.344 469.046 105.344C471.086 105.344 472.91 105.776 474.518 106.64C476.126 107.48 477.386 108.644 478.298 110.132C479.21 111.62 479.666 113.348 479.666 115.316C479.666 117.236 479.21 118.952 478.298 120.464C477.386 121.952 476.126 123.128 474.518 123.992C472.91 124.856 471.086 125.288 469.046 125.288ZM469.046 120.68C469.982 120.68 470.822 120.464 471.566 120.032C472.31 119.6 472.898 118.988 473.33 118.196C473.762 117.38 473.978 116.42 473.978 115.316C473.978 114.188 473.762 113.228 473.33 112.436C472.898 111.644 472.31 111.032 471.566 110.6C470.822 110.168 469.982 109.952 469.046 109.952C468.11 109.952 467.27 110.168 466.526 110.6C465.782 111.032 465.182 111.644 464.726 112.436C464.294 113.228 464.078 114.188 464.078 115.316C464.078 116.42 464.294 117.38 464.726 118.196C465.182 118.988 465.782 119.6 466.526 120.032C467.27 120.464 468.11 120.68 469.046 120.68ZM489.936 125.288C488.28 125.288 486.684 125.096 485.148 124.712C483.636 124.304 482.436 123.8 481.548 123.2L483.42 119.168C484.308 119.72 485.352 120.176 486.552 120.536C487.776 120.872 488.976 121.04 490.152 121.04C491.448 121.04 492.36 120.884 492.888 120.572C493.44 120.26 493.716 119.828 493.716 119.276C493.716 118.82 493.5 118.484 493.068 118.268C492.66 118.028 492.108 117.848 491.412 117.728C490.716 117.608 489.948 117.488 489.108 117.368C488.292 117.248 487.464 117.092 486.624 116.9C485.784 116.684 485.016 116.372 484.32 115.964C483.624 115.556 483.06 115.004 482.628 114.308C482.22 113.612 482.016 112.712 482.016 111.608C482.016 110.384 482.364 109.304 483.06 108.368C483.78 107.432 484.812 106.7 486.156 106.172C487.5 105.62 489.108 105.344 490.98 105.344C492.3 105.344 493.644 105.488 495.012 105.776C496.38 106.064 497.52 106.484 498.432 107.036L496.56 111.032C495.624 110.48 494.676 110.108 493.716 109.916C492.78 109.7 491.868 109.592 490.98 109.592C489.732 109.592 488.82 109.76 488.244 110.096C487.668 110.432 487.38 110.864 487.38 111.392C487.38 111.872 487.584 112.232 487.992 112.472C488.424 112.712 488.988 112.904 489.684 113.048C490.38 113.192 491.136 113.324 491.952 113.444C492.792 113.54 493.632 113.696 494.472 113.912C495.312 114.128 496.068 114.44 496.74 114.848C497.436 115.232 498 115.772 498.432 116.468C498.864 117.14 499.08 118.028 499.08 119.132C499.08 120.332 498.72 121.4 498 122.336C497.28 123.248 496.236 123.968 494.868 124.496C493.524 125.024 491.88 125.288 489.936 125.288Z" fill="white"/>
            </svg>
        </section>

        <section class="container container_main  page-block company__cards-container">
            <div class="company-card company-card_fill">
                <div class="company-card__content">
                    <h2 class="company-card__header headline">
                        Создаем новое
                    </h2>
                    <p class="company-card__text text">
                        Благодаря современным технологиям, ИИ, новым версиям игровых движков и инновационным механикам мы открываем новые горизонты в мире развлечений.
                    </p>
                </div>
                <div class="company-card__vector-container">
                    <svg class="company-card__vector" width="91" height="73" viewBox="0 0 91 73" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M0.376532 25.887L0.352051 72.4273L43.7041 72.401L0.376532 25.887Z" fill="#1E1E1E"/>
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M23.7141 36.613L23.733 0.812744L90.3909 72.3728L57.4999 72.401C57.4879 72.4008 57.4667 72.4006 57.4366 72.4004C57.3592 72.3999 57.2235 72.3995 57.0373 72.3992L57.0431 72.393L23.7141 36.613Z" fill="#1E1E1E"/>
                    </svg>
                </div>
            </div>
            <div class="company-card company-card_fill">
                <div class="company-card__content">
                    <h2 class="company-card__header headline">
                        Работаем в команде
                    </h2>
                    <p class="company-card__text text">
                        Сплоченная команда и дружелюбная атмосфера. Разработка игр - сложный процесс, полный стресса и ошибок, но мы не сдаемся и работаем вместе, чтобы наши игры полюбились Вам также как и нам.
                    </p>
                </div>
                <div class="company-card__vector-container">
                    <svg class="company-card__vector" width="91" height="73" viewBox="0 0 91 73" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M0.376532 25.887L0.352051 72.4273L43.7041 72.401L0.376532 25.887Z" fill="#1E1E1E"/>
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M23.7141 36.613L23.733 0.812744L90.3909 72.3728L57.4999 72.401C57.4879 72.4008 57.4667 72.4006 57.4366 72.4004C57.3592 72.3999 57.2235 72.3995 57.0373 72.3992L57.0431 72.393L23.7141 36.613Z" fill="#1E1E1E"/>
                    </svg>
                </div>
            </div>
            <div class="company-card">
                <div class="company-card__content">
                    <h2 class="company-card__header headline">
                        Хочешь сотрудничать?
                    </h2>
                    <p class="company-card__text text">
                        Вместе веселей! Мы всегда открыты к сотрудничеству и коллаборациям. Мы провели уже более 20 коллабораций, присоединяйся и ты
                    </p>
                </div>
                <div class="company-card__copy-btn ">
                    <BtnItem :isSecondary=true class="copy-btn">
                        <p class="copy-btn__email headline headline_medium">partners@dash.ru</p>
                        <svg class="copy-btn__icon" width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <mask id="mask0_129_889" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24" height="25">
                            <rect y="0.5" width="24" height="24" fill="#D9D9D9"/>
                            </mask>
                            <g mask="url(#mask0_129_889)"><path d="M5 22.5C4.45 22.5 3.97917 22.3042 3.5875 21.9125C3.19583 21.5208 3 21.05 3 20.5V6.5H5V20.5H16V22.5H5ZM9 18.5C8.45 18.5 7.97917 18.3042 7.5875 17.9125C7.19583 17.5208 7 17.05 7 16.5V4.5C7 3.95 7.19583 3.47917 7.5875 3.0875C7.97917 2.69583 8.45 2.5 9 2.5H18C18.55 2.5 19.0208 2.69583 19.4125 3.0875C19.8042 3.47917 20 3.95 20 4.5V16.5C20 17.05 19.8042 17.5208 19.4125 17.9125C19.0208 18.3042 18.55 18.5 18 18.5H9ZM9 16.5H18V4.5H9V16.5Z" fill="white"/></g>
                        </svg>
                    </BtnItem>
                </div>
            </div>
            <div class="company-card">
                <div class="company-card__content">
                    <h2 class="company-card__header headline">
                        Работа в Dash
                    </h2>
                    <p class="company-card__text text">
                        Хочешь научиться новому, поучавствовать в интересных проектах и горишь желанием открыть для себя мир геймдева - напиши нам!
                    </p>
                </div>
                <div class="company-card__copy-btn ">
                    <BtnItem :isSecondary=true class="copy-btn">
                        <p class="copy-btn__email headline headline_medium">join@dash.ru</p>
                        <svg class="copy-btn__icon" width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <mask id="mask0_129_889" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24" height="25">
                            <rect y="0.5" width="24" height="24" fill="#D9D9D9"/>
                            </mask>
                            <g mask="url(#mask0_129_889)"><path d="M5 22.5C4.45 22.5 3.97917 22.3042 3.5875 21.9125C3.19583 21.5208 3 21.05 3 20.5V6.5H5V20.5H16V22.5H5ZM9 18.5C8.45 18.5 7.97917 18.3042 7.5875 17.9125C7.19583 17.5208 7 17.05 7 16.5V4.5C7 3.95 7.19583 3.47917 7.5875 3.0875C7.97917 2.69583 8.45 2.5 9 2.5H18C18.55 2.5 19.0208 2.69583 19.4125 3.0875C19.8042 3.47917 20 3.95 20 4.5V16.5C20 17.05 19.8042 17.5208 19.4125 17.9125C19.0208 18.3042 18.55 18.5 18 18.5H9ZM9 16.5H18V4.5H9V16.5Z" fill="white"/></g>
                        </svg>
                    </BtnItem>
                </div>
                
            </div>
        </section>

        <section class="container container_main  page-block company__numbers">
            <div class="numbers">
                <div class="numbers__item">
                    <h2 class="humbers__headline headline">
                        20 лет<br> Разработки
                    </h2>
                    <p class="numbers__text text">
                        Огромный опыт и самое интересное еще впереди
                    </p>
                </div>
                <div class="numbers__item">
                    <h2 class="humbers__headline headline">
                        150+<br> проектов
                    </h2>
                    <p class="numbers__text text">
                        Наши игры занимают топы и получают высокие оценки
                    </p>
                </div>
                <div class="numbers__item">
                    <h2 class="humbers__headline headline">
                        300+ <br> в команде
                    </h2>
                    <p class="numbers__text text">
                        Cплоченная команда, которой мы гордимся
                    </p>
                </div>
            </div>
        </section>
        <section class="container container_main  page-block help-cards">
            <div class="company-card">
                <div class="company-card__content">
                    <h2 class="company-card__header headline">
                        Остались вопросы?
                    </h2>
                    <p class="company-card__text text">
                        Есть жалобы, вопросы или предложения? Напиши нам и наши операторы помогут с любой ситуацией
                    </p>
                </div>
                <div class="company-card__copy-btn ">
                    <BtnItem :isSecondary=true :isWhite=true class="copy-btn">
                        <p class="copy-btn__email headline headline_medium headline_black">help@dash.ru</p>
                        <svg class="copy-btn__icon" width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <mask id="mask0_129_889" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="24" height="25">
                            <rect y="0.5" width="24" height="24" fill="#1E1E1E"/>
                            </mask>
                            <g mask="url(#mask0_129_889)"><path d="M5 22.5C4.45 22.5 3.97917 22.3042 3.5875 21.9125C3.19583 21.5208 3 21.05 3 20.5V6.5H5V20.5H16V22.5H5ZM9 18.5C8.45 18.5 7.97917 18.3042 7.5875 17.9125C7.19583 17.5208 7 17.05 7 16.5V4.5C7 3.95 7.19583 3.47917 7.5875 3.0875C7.97917 2.69583 8.45 2.5 9 2.5H18C18.55 2.5 19.0208 2.69583 19.4125 3.0875C19.8042 3.47917 20 3.95 20 4.5V16.5C20 17.05 19.8042 17.5208 19.4125 17.9125C19.0208 18.3042 18.55 18.5 18 18.5H9ZM9 16.5H18V4.5H9V16.5Z" fill="#1E1E1E"/></g>
                        </svg>
                    </BtnItem>
                </div>
                
            </div>
        </section>
        
    </div>
    
    <FooterItem></FooterItem>
</template>

<script>
    import NavbarItem from '@/components/NavbarItem.vue';
    import FooterItem from '@/components/FooterItem.vue';
    import BtnItem from '@/components/BtnItem.vue'

    export default {
        name: 'HomePage',
        components:{
            NavbarItem,
            FooterItem,
            BtnItem
        },
    }
</script>

<style lang="scss" scoped>
    .company{
        &__logo{
            max-width: 100%;
        }
        &__logo-container{
            max-width: 30%;
        }

        &__cards-container{
            display: flex;
            flex-direction: row;
            gap: 1rem;
            flex-wrap: wrap;
            justify-content: space-between;
        }
    }

    .company-card{
        position: relative;
        display: flex;
        flex-direction: column;
        width: 48%;
        min-width: 32rem;
        max-width: 42rem;
        box-sizing: border-box;
        padding: 2.5rem 4.375rem 4.375rem;
        border-radius: 0.625rem;
        gap: 1.875rem;

        &_fill{
            background-color: var(--LightSmoothBlack);
        }
        
        &__content{
            // max-width: 60%;
            display: flex;
            flex-direction: column;
            gap: 1.25rem;
            position: relative;
            z-index: 2;
        }

        &__vector-container{
            position: absolute;
            z-index: 1;
            bottom: 0;
            right: 10%;
        }

        &__vector{
            display: block;
        }
    }

    .copy-btn{
        display: flex;
        gap: 1rem;
        &__email{
            font-weight:600;
        }
    }
    
    .numbers{
        display: flex;
        flex-wrap: wrap;
        justify-content: space-around;
        background-color: var(--LightSmoothBlack);
        border-radius: 0.625rem;
        padding: 4rem clamp(1rem, 4%, 4rem);
        gap: 4rem;
        &__item{
            display: flex;
            flex-direction: column;
            gap: 1.25rem;
            max-width: 18rem;
        }
    }

    .help-cards{
        display: flex;
        align-items: center;
        justify-content: center;
    }

    @media screen and (max-width: 1439px) {
        .company-card{
            width: auto;
            max-width: 100%;
            min-width:auto;
            padding: clamp(2.5rem, 10%, 4rem );
        }

        .numbers{
            flex-direction: column;
                align-items: center;
        }
    }

    @media screen and (max-width: 425px) {
        .company{
            &__logo-container{
                max-width: 50%;
            }
        }
        .copy-btn{
                &__email{
                    font-size: 1.25rem;
                }
            }
        }
</style>